Repository: BoxMars/PicImpact
Catalog: ios/大福映画/Resources/Localizable.xcstrings
Source language: zh
Languages: en, ja, zh_tw

# Account.avatar
source: 头像
en: Avatar
ja: アバター
zh_tw: 頭像

# Account.email
source: 邮箱
en: Email
ja: メール
zh_tw: 電子郵件

# Account.inputAvatar
source: 请输入新的头像地址。
en: Please enter the avatar URL.
ja: アバターをアップロードしてください
zh_tw: 請輸入新的頭像地址。

# Account.inputEmail
source: 请输入新的邮箱地址。
en: Please enter the new email address.
ja: 新しいメールアドレスを入力してください。
zh_tw: 請輸入新的電子郵件地址。

# Account.inputUsername
source: 请输入新的用户名。
en: Please enter the new username.
ja: 新しいユーザー名を入力してください。
zh_tw: 請輸入新的用戶名。

# Account.username
source: 用户名
en: Username
ja: ユーザー名
zh_tw: 用戶名

# Album.addAlbum
source: 新增相册
en: Add Album
ja: アルバムを追加
zh_tw: 新增相簿

# Album.albumId
source: 相册 ID
en: Album ID
ja: アルバム ID
zh_tw: 相簿 ID

# Album.albumName
source: 相册名称
en: Album Name
ja: アルバム名
zh_tw: 相簿名稱

# Album.albumRouter
source: 相册路由
en: Album Router
ja: アルバムルーター
zh_tw: 相簿路由

# Album.deleteAlbum
source: 删除相册
en: Delete Album
ja: アルバムを削除
zh_tw: 刪除相簿

# Album.detail
source: 详情
en: Detail
ja: 詳細
zh_tw: 詳情

# Album.editAlbum
source: 编辑相册
en: Edit Album
ja: アルバムを編集
zh_tw: 編輯相簿

# Album.editAlbumTitle
source: 编辑相册
en: Edit Album
ja: アルバムを編集
zh_tw: 編輯相簿

# Album.imageSortRule
source: 相册内图片排序规则
en: Album Image Sort Rule
ja: アルバム内の画像並び替えルール
zh_tw: 相簿內圖片排序規則

# Album.inputDetail
source: 输入详情
en: Enter detail
ja: 詳細を入力
zh_tw: 輸入詳情

# Album.inputName
source: 输入相册名称
en: Enter album name
ja: アルバム名を入力
zh_tw: 輸入相簿名稱

# Album.inputRouter
source: 输入路由，如：/tietie
en: Enter router, e.g., /tietie
ja: ルーターを入力、例：/tietie
zh_tw: 輸入路由，如：/tietie

# Album.license
source: 许可协议
en: License
ja: ライセンス
zh_tw: 許可協議

# Album.management
source: 相册管理
en: Album Management
ja: アルバム管理
zh_tw: 相簿管理

# Album.name
source: 相册名称
en: Album Name
ja: アルバム名
zh_tw: 相簿名稱

# Album.noTips
source: 没有介绍
en: No introduction available
ja: 紹介はありません
zh_tw: 沒有介紹

# Album.randomSort
source: 随机排序
en: Random Sort
ja: ランダム並び替え
zh_tw: 隨機排序

# Album.randomSortDesc
source: 开启后，每次加载相册时会随机打乱图片顺序。
en: When enabled, the image order will be randomly shuffled each time the album is loaded.
ja: 有効にすると、アルバムを読み込むたびに画像の順序がランダムに変更されます。
zh_tw: 開啟後，每次加載相簿時會隨機打亂圖片順序。

# Album.requiredFields
source: 请先填写必填项！
en: Please fill in the required fields first!
ja: 必須項目を入力してください！
zh_tw: 請先填寫必填項！

# Album.rootRouterWarning
source: / 路由不允许设置为不显示！
en: / router cannot be set to hidden!
ja: / ルーターは非表示に設定できません！
zh_tw: / 路由不允許設置為不顯示！

# Album.router
source: 路由
en: Router
ja: ルーター

# Album.routerDetail
source: 可以访问的一级路径
en: Accessible primary path
ja: アクセス可能な一次パス
zh_tw: 可以訪問的一級路徑

# Album.routerStartWithSlash
source: 路由必须以 / 开头！
en: Router must start with /!
ja: ルーターは / で始める必要があります！
zh_tw: 路由必須以 / 開頭！

# Album.selectSortRule
source: 选择排序规则
en: Select sort rule
ja: 並び替えルールを選択
zh_tw: 選擇排序規則

# Album.shootTimeNewToOld
source: 拍摄时间从新到旧
en: Shoot time from new to old
ja: 撮影時間の新しい順
zh_tw: 拍攝時間從新到舊

# Album.shootTimeOldToNew
source: 拍摄时间从旧到新
en: Shoot time from old to new
ja: 撮影時間の古い順
zh_tw: 拍攝時間從舊到新

# Album.showStatus
source: 显示状态
en: Show Status
ja: 表示状態
zh_tw: 顯示狀態

# Album.showStatusDesc
source: 是否需要在首页以路由形式呈现，点击后跳转页面。
en: Whether to display as a route on the homepage, click to navigate to the page.
ja: ホームページでルートとして表示し、クリックでページに移動するかどうか。
zh_tw: 是否需要在首頁以路由形式呈現，點擊後跳轉頁面。

# Album.sort
source: 排序
en: Sort
ja: 並び替え

# Album.submit
source: 提交
en: Submit
ja: 提出

# Album.update
source: 更新
en: Update

# Album.uploadTimeNewToOld
source: 上传时间从新到旧
en: Upload time from new to old
ja: アップロード時間の新しい順
zh_tw: 上傳時間從新到舊

# Album.uploadTimeOldToNew
source: 上传时间从旧到新
en: Upload time from old to new
ja: アップロード時間の古い順
zh_tw: 上傳時間從舊到新

# Button.add
source: 新增
en: Add
ja: 追加

# Button.batchDelete
source: 批量删除
en: Batch Delete
ja: 批量削除
zh_tw: 批量刪除

# Button.canal
source: 取消
en: Cancel
ja: キャンセル

# Button.close
source: 关闭
en: Close
ja: 閉じる
zh_tw: 關閉

# Button.dark
source: 切换至⌈常夜⌋
en: Switch to Dark Mode
ja: ⌈常夜⌋に切り替える
zh_tw: 切換至⌈常夜⌋

# Button.delete
source: 删除
en: Delete
ja: 削除
zh_tw: 刪除

# Button.goBack
source: 返回
en: Back
ja: 戻る

# Button.help
source: 帮助
en: Help
ja: ヘルプ
zh_tw: 幫助

# Button.issue
source: 反馈 | 建议
en: Feedback | Suggestions
ja: フィードバック | 提案
zh_tw: 反饋 | 建議

# Button.language
source: 切换语言
en: Switch Language
ja: 言語を切り替える
zh_tw: 切換語言

# Button.light
source: 切换至⌈白夜⌋
en: Switch to Light Mode
ja: ⌈白夜⌋に切り替える
zh_tw: 切換至⌈白夜⌋

# Button.loadMore
source: 加载更多
en: Load More
ja: もっと読み込む
zh_tw: 載入更多

# Button.login
source: 登录
en: Login
ja: ログイン
zh_tw: 登入

# Button.refresh
source: 刷新
en: Refresh
ja: 更新

# Button.removeTwoFactor
source: 移除双因素验证
en: Remove Two-Factor
ja: 二要素認証を削除
zh_tw: 移除雙因素驗證

# Button.reset
source: 重置
en: Reset
ja: リセット

# Button.submit
source: 提交
en: Submit
ja: 提出

# Button.update
source: 更新
en: Update

# Button.yesDelete
source: 确认删除
en: Confirm Delete
ja: 削除を確認
zh_tw: 確定刪除

# Command.album
source: 相册
en: Album
ja: アルバム
zh_tw: 相簿

# Command.menu
source: 菜单
en: Menu
ja: メニュー
zh_tw: 選單

# Command.noResults
source: 未找到结果。
en: No results found.
ja: 結果が見つかりません。
zh_tw: 未找到結果。

# Command.placeholder
source: 输入命令或搜索...
en: Type a command or search...
ja: コマンドまたは検索を入力...
zh_tw: 輸入命令或搜尋...

# Command.settings
source: 设置
en: Settings
ja: 設定
zh_tw: 設定

# Config.accesskey_id
source: 阿里 OSS / AWS S3 AccessKey_ID
en: Aliyun OSS / AWS S3 AccessKey_ID
ja: Aliyun OSS / AWS S3 AccessKey_ID

# Config.accesskey_secret
source: 阿里 OSS / AWS S3 AccessKey_Secret
en: Aliyun OSS / AWS S3 AccessKey_Secret
ja: Aliyun OSS / AWS S3 AccessKey_Secret

# Config.bucket
source: 阿里 OSS / AWS S3 Bucket 存储桶名称，如：picimpact
en: Aliyun OSS / AWS S3 Bucket name, e.g., picimpact
ja: Aliyun OSS / AWS S3 Bucket 名、例：picimpact
zh_tw: 阿里 OSS / AWS S3 Bucket 儲存桶名稱，如：picimpact

# Config.edit
source: 编辑
en: Edit
ja: 編集
zh_tw: 編輯

# Config.editOpenList
source: 编辑 Open List
en: Edit Open List
ja: Open List を編集
zh_tw: 編輯 Open List

# Config.editR2
source: 编辑 Cloudflare R2
en: Edit Cloudflare R2
ja: Cloudflare R2 を編集
zh_tw: 編輯 Cloudflare R2

# Config.editS3
source: 编辑 S3
en: Edit S3
ja: S3 を編集
zh_tw: 編輯 S3

# Config.endpoint
source: 阿里 OSS / AWS S3 Endpoint 地域节点，如：oss-cn-hongkong.aliyuncs.com
en: Aliyun OSS / AWS S3 Endpoint, e.g., oss-cn-hongkong.aliyuncs.com
ja: Aliyun OSS / AWS S3 Endpoint、例：oss-cn-hongkong.aliyuncs.com
zh_tw: 阿里 OSS / AWS S3 Endpoint 地域節點，如：oss-cn-hongkong.aliyuncs.com

# Config.force_path_style
source: 是否强制客户端对桶使用路径式寻址
en: Whether to force the client to use path-based addressing for buckets.
ja: クライアントにバケットのパスベースのアドレス指定を強制するかどうか
zh_tw: 是否強制客戶端對桶使用路徑式尋址

# Config.openListTitle
source: Open List 配置
en: Open List Configuration
ja: Open List 設定
zh_tw: Open List 設定

# Config.open_list_token
source: Open List 令牌
en: Open List token
ja: Open List トークン

# Config.open_list_url
source: Open List 地址，如：https://openlist.besscroft.com
en: Open List URL, e.g., https://openlist.besscroft.com
ja: Open List アドレス、例：https://openlist.besscroft.com

# Config.r2Title
source: Cloudflare R2 配置
en: Cloudflare R2 Configuration
ja: Cloudflare R2 設定
zh_tw: Cloudflare R2 設定

# Config.r2_bucket
source: Cloudflare Bucket 存储桶名称，如：picimpact
en: Cloudflare Bucket name (e.g., picimpact)
ja: Cloudflare Bucket バケット名（例：picimpact）
zh_tw: Cloudflare Bucket 存儲桶名稱，如：picimpact

# Config.r2_direct_download
source: 是否启用 R2 直链下载模式
en: Whether to enable R2 direct link download mode.
ja: R2直接リンクダウンロードモードを有効にするかどうか
zh_tw: 是否啟用 R2 直鏈下載模式

# Config.r2_public_domain
source: Cloudflare R2 自定义域（公开访问）
en: Cloudflare R2 custom domain (public access)
ja: Cloudflare R2 カスタムドメイン（公開アクセス）
zh_tw: Cloudflare R2 自定義域（公開訪問）

# Config.r2_storage_folder
source: 存储文件夹(Cloudflare R2)，严格格式，如：picimpact 或 picimpact/images ，填 / 或者不填表示根路径
en: Storage folder (Cloudflare R2). Strict format (e.g., picimpact or picimpact/images). Use '/' or leave blank for root path
ja: 保存フォルダ（Cloudflare R2）。厳密な形式（例：picimpact または picimpact/images）。「/」または未入力はルートパスを意味します
zh_tw: 存儲文件夾(Cloudflare R2)，嚴格格式，如：picimpact 或 picimpact/images ，填 / 或者不填表示根路徑

# Config.refresh
source: 刷新
en: Refresh
ja: 更新

# Config.region
source: 阿里 OSS / AWS S3 Region 地域，如：oss-cn-hongkong
en: Aliyun OSS / AWS S3 Region, e.g., oss-cn-hongkong
ja: Aliyun OSS / AWS S3 Region、例：oss-cn-hongkong

# Config.requestFailed
source: 请求失败！
en: Request failed!
ja: リクエストに失敗しました！
zh_tw: 請求失敗！

# Config.s3Title
source: S3 配置
en: S3 Configuration
ja: S3 設定
zh_tw: S3 設定

# Config.s3_cdn
source: 是否启用 S3 CDN 模式，路径将返回 cdn 地址
en: Whether to enable S3 CDN mode, the path will return the cdn address.
ja: S3 CDNモードを有効にするかどうか、パスはCDNアドレスを返します
zh_tw: 是否啟用 S3 CDN 模式，路徑將返回 cdn 地址

# Config.s3_cdn_url
source: cdn 地址，如：https://cdn.example.com
en: CDN URL, e.g., https://cdn.example.com
ja: CDN アドレス、例：https://cdn.example.com

# Config.s3_direct_download
source: 是否启用 S3 直链下载模式
en: Whether to enable S3 direct link download mode.
ja: S3 直接リンクダウンロードモードを有効にするかどうか
zh_tw: 是否啟用 S3 直鏈下載模式

# Config.storage_folder
source: 存储文件夹(S3)，严格格式，如：picimpact 或 picimpact/images ，填 / 或者不填表示根路径
en: Storage folder (S3), strict format, e.g., picimpact or picimpact/images, leave empty or / for root path
ja: ストレージフォルダ(S3)、厳密な形式、例：picimpact または picimpact/images、/ または空欄はルートパスを表す
zh_tw: 儲存資料夾(S3)，嚴格格式，如：picimpact 或 picimpact/images ，填 / 或者不填表示根路徑

# Config.submit
source: 提交
en: Submit
ja: 提出

# Config.updateFailed
source: 更新失败！
en: Update failed!
ja: 更新に失敗しました！
zh_tw: 更新失敗！

# Config.updateSuccess
source: 更新成功！
en: Update successful!
ja: 更新に成功しました！

# Dashboard.albumData
source: 相册数据
en: Album Data
ja: アルバムデータ
zh_tw: 相簿數據

# Dashboard.bisData
source: 业务数据
en: Business Data
ja: ビジネスデータ
zh_tw: 業務數據

# Dashboard.camera
source: 相机
en: Camera
ja: カメラ
zh_tw: 相機

# Dashboard.cameraStats
source: 拍摄设备统计
en: Camera Equipment Statistics
ja: 撮影機器の統計
zh_tw: 拍攝設備統計

# Dashboard.count
source: 数量/张
en: Count/Photos
ja: 枚数/枚
zh_tw: 數量/張

# Dashboard.ge
source: 个
en: Items
ja: 個
zh_tw: 個

# Dashboard.how
source: 感觉如何？
en: How do you feel?
ja: どう感じますか？
zh_tw: 感覺如何？

# Dashboard.issueTip
source: 如果您有 Bug 反馈和建议
en: If you have bug feedback or suggestions
ja: バグのフィードバックや提案がある場合
zh_tw: 如果您有 Bug 反饋和建議

# Dashboard.lens
source: 镜头
en: Lens
ja: レンズ
zh_tw: 鏡頭

# Dashboard.picData
source: 照片数据
en: Photo Data
ja: 写真データ
zh_tw: 照片數據

# Dashboard.picShow
source: 显示照片
en: Show Photos
ja: 写真を表示
zh_tw: 顯示照片

# Dashboard.show
source: 显示/张
en: Show/Photos
ja: 表示/枚
zh_tw: 顯示/張

# Dashboard.starTip
source: 如果您觉得项目不错
en: If you think this project is good
ja: プロジェクトが良いと思われる場合
zh_tw: 如果您覺得專案不錯

# Dashboard.zhang
source: 张
en: Photos
ja: 枚
zh_tw: 張

# Exif.apertureValue
source: 光圈值
en: Aperture Value
ja: 絞り値

# Exif.basicInfo
source: 基本信息
en: Basic Information
ja: 基本情報
zh_tw: 基本資訊

# Exif.bitDepth
source: 位深度
en: Bit Depth
ja: ビット深度
zh_tw: 位元深度

# Exif.brightness
source: 亮度
en: Brightness
ja: 明るさ

# Exif.brightnessValue
source: 亮度值
en: Brightness Value
ja: 明るさ値

# Exif.camera
source: 相机
en: Camera
ja: カメラ
zh_tw: 相機

# Exif.captureMode
source: 拍摄模式
en: Capture Mode
ja: 撮影モード
zh_tw: 拍攝模式

# Exif.captureParams
source: 拍摄参数
en: Capture Parameters
ja: 撮影パラメータ
zh_tw: 拍攝參數

# Exif.captureTime
source: 拍摄时间
en: Capture Time
ja: 撮影時刻
zh_tw: 拍攝時間

# Exif.cfaPattern
source: CFA 模式
en: CFA Pattern
ja: CFAパターン

# Exif.colorSpace
source: 色彩空间
en: Color Space
ja: カラースペース
zh_tw: 色彩空間

# Exif.contrast
source: 对比度
en: Contrast
ja: コントラスト
zh_tw: 對比度

# Exif.copyExif
source: 复制 EXIF
en: Copy EXIF
ja: EXIFをコピー
zh_tw: 複製 EXIF

# Exif.copyFailed
source: 复制失败！
en: Copy failed!
ja: コピーに失敗しました！
zh_tw: 複製失敗！

# Exif.copySuccess
source: 复制成功！
en: Copied successfully!
ja: コピーしました！
zh_tw: 複製成功！

# Exif.deviceInfo
source: 设备信息
en: Device Information
ja: デバイス情報
zh_tw: 設備資訊

# Exif.dimensions
source: 尺寸
en: Dimensions
ja: サイズ

# Exif.exposureMode
source: 曝光模式
en: Exposure Mode
ja: 露出モード

# Exif.exposureProgram
source: 曝光程序
en: Exposure Program
ja: 露出プログラム
zh_tw: 曝光程式

# Exif.fileSize
source: 文件大小
en: File Size
ja: ファイルサイズ
zh_tw: 檔案大小

# Exif.filename
source: 文件名
en: Filename
ja: ファイル名
zh_tw: 檔案名稱

# Exif.flash
source: 闪光灯
en: Flash
ja: フラッシュ
zh_tw: 閃光燈

# Exif.focalLength
source: 焦距
en: Focal Length
ja: 焦点距離

# Exif.focalLength35mm
source: 等效焦距
en: 35mm Equivalent
ja: 35mm換算

# Exif.focalPlaneResolution
source: 焦平面分辨率
en: Focal Plane Resolution
ja: 焦点面解像度
zh_tw: 焦平面解析度

# Exif.format
source: 格式
en: Format
ja: フォーマット

# Exif.highlightRatio
source: 高光占比
en: Highlight Ratio
ja: ハイライト比率
zh_tw: 高光佔比

# Exif.histogram
source: 直方图
en: Histogram
ja: ヒストグラム
zh_tw: 直方圖

# Exif.histogramCorsError
source: 需要在存储服务中配置 CORS
en: CORS configuration required in storage
ja: ストレージでCORS設定が必要です
zh_tw: 需要在儲存服務中配置 CORS

# Exif.histogramError
source: 直方图加载失败
en: Failed to load histogram
ja: ヒストグラムの読み込みに失敗しました
zh_tw: 直方圖載入失敗

# Exif.lens
source: 镜头
en: Lens
ja: レンズ
zh_tw: 鏡頭

# Exif.lightSource
source: 光源
en: Light Source

# Exif.maxAperture
source: 最大光圈
en: Max Aperture
ja: 最大絞り値

# Exif.meteringMode
source: 测光模式
en: Metering Mode
ja: 測光モード
zh_tw: 測光模式

# Exif.pixels
source: 像素
en: Pixels
ja: ピクセル

# Exif.sceneCaptureType
source: 场景类型
en: Scene Capture Type
ja: シーンタイプ
zh_tw: 場景類型

# Exif.sensingMethod
source: 感光方法
en: Sensing Method
ja: 撮像方式

# Exif.shadowRatio
source: 阴影占比
en: Shadow Ratio
ja: シャドウ比率
zh_tw: 陰影佔比

# Exif.shutterSpeedValue
source: 快门速度值
en: Shutter Speed Value
ja: シャッター速度値
zh_tw: 快門速度值

# Exif.tags
source: 标签
en: Tags
ja: タグ
zh_tw: 標籤

# Exif.technicalParams
source: 技术参数
en: Technical Parameters
ja: 技術パラメータ
zh_tw: 技術參數

# Exif.title
source: 详细信息
en: Details
ja: 詳細情報
zh_tw: 詳細資訊

# Exif.toneAnalysis
source: 影调分析
en: Tone Analysis
ja: トーン分析
zh_tw: 影調分析

# Exif.toneAnalysisCorsError
source: 需要配置 CORS
en: CORS configuration required
ja: CORS設定が必要です

# Exif.toneHighContrast
source: 高对比度
en: High Contrast
ja: ハイコントラスト
zh_tw: 高對比度

# Exif.toneHighKey
source: 高调
en: High Key
ja: ハイキー
zh_tw: 高調

# Exif.toneLowKey
source: 低调
en: Low Key
ja: ローキー
zh_tw: 低調

# Exif.toneNormal
source: 正常
en: Normal
ja: 標準

# Exif.toneType
source: 影调类型
en: Tone Type
ja: トーンタイプ
zh_tw: 影調類型

# Exif.whiteBalance
source: 白平衡
en: White Balance
ja: ホワイトバランス

# Filter.all
source: 全部
en: All
ja: すべて

# Filter.camera
source: 相机
en: Camera
ja: カメラ
zh_tw: 相機

# Filter.lens
source: 镜头
en: Lens
ja: レンズ
zh_tw: 鏡頭

# Filter.reset
source: 重置筛选
en: Reset Filter
ja: フィルターをリセット
zh_tw: 重置篩選

# Filter.title
source: 筛选
en: Filter
ja: フィルター
zh_tw: 篩選

# Link.about
source: 关于
en: About
ja: について
zh_tw: 關於

# Link.account
source: 账户设置
en: Account Settings
ja: アカウント設定
zh_tw: 帳戶設定

# Link.album
source: 相册管理
en: Album Management
ja: アルバム管理
zh_tw: 相簿管理

# Link.authenticator
source: 双因素验证
en: Two-Factor Authentication
ja: 二要素認証
zh_tw: 雙因素驗證

# Link.dashboard
source: 控制台
en: Dashboard
ja: ダッシュボード

# Link.home
source: 首页
en: Home
ja: ホーム
zh_tw: 首頁

# Link.list
source: 图片维护
en: Image Management
ja: 画像維持
zh_tw: 圖片維護

# Link.map
source: 地图
en: Map
ja: 地図
zh_tw: 地圖

# Link.password
source: 密码修改
en: Change Password
ja: パスワード変更
zh_tw: 密碼修改

# Link.preferences
source: 首选项
en: Preferences
ja: 優先設定
zh_tw: 首選項

# Link.settings
source: 设置
en: Settings
ja: 設定
zh_tw: 設定

# Link.storages
source: 存储配置
en: Storage Configuration
ja: ストレージ設定
zh_tw: 儲存配置

# Link.upload
source: 上传
en: Upload
ja: アップロード
zh_tw: 上傳

# List.albumDisplay
source: 图片在对应的相册上显示
en: Images will be displayed in the corresponding album
ja: 画像は対応するアルバムに表示されます
zh_tw: 圖片在對應的相簿上顯示

# List.bindAlbum
source: 绑定相册
en: Bind Album
ja: アルバムをバインド
zh_tw: 綁定相簿

# List.camera
source: 相机
en: Camera
ja: カメラ
zh_tw: 相機

# List.editImage
source: 编辑图片
en: Edit Image
ja: 画像を編集
zh_tw: 編輯圖片

# List.lens
source: 镜头
en: Lens
ja: レンズ
zh_tw: 鏡頭

# List.pleaseSelectAlbum
source: 请选择相册
en: Please select an album
ja: アルバムを選択してください
zh_tw: 請選擇相簿

# List.rule
source: 从高到低
en: From high to low
ja: 高い順から低い順
zh_tw: 從高到低

# List.selectAlbum
source: 请选择相册
en: Please select an album
ja: アルバムを選択してください
zh_tw: 請選擇相簿

# List.selectCamera
source: 选择相机
en: Select Camera
ja: カメラを選択
zh_tw: 選擇相機

# List.selectLens
source: 选择镜头
en: Select Lens
ja: レンズを選択
zh_tw: 選擇鏡頭

# List.selectShowStatus
source: 选择公开状态
en: Select Show Status
ja: 表示状態を選択
zh_tw: 選擇公開狀態

# List.viewImage
source: 查看图片
en: View Image
ja: 画像を表示
zh_tw: 查看圖片

# Login.email
source: 邮箱
en: Email
ja: メール
zh_tw: 電子郵件

# Login.forget
source: 忘记密码了？
en: Forgot Password?
ja: パスワードをお忘れですか？
zh_tw: 忘記密碼了？

# Login.goHome
source: 返回首页
en: Back to Home
ja: ホームに戻る
zh_tw: 返回首頁

# Login.logout
source: 退出登录
en: Logout
ja: ログアウト
zh_tw: 登出

# Login.or
source: 或者
en: or
ja: または

# Login.otp
source: 双因素口令
en: Two-Factor Code
ja: 二要素認証コード
zh_tw: 雙因素口令

# Login.passkeyLogin
source: 使用 Passkey 登录
en: Sign in with Passkey
ja: Passkey でログイン
zh_tw: 使用 Passkey 登入

# Login.password
source: 密码
en: Password
ja: パスワード
zh_tw: 密碼

# Login.signIn
source: 登录
en: SignIn
ja: ログイン
zh_tw: 登入

# Login.signUp
source: 注册
en: SignUp
ja: 登録する
zh_tw: 註冊

# Login.title
source: 欢迎登录
en: Welcome to Login
ja: 歓迎ログイン
zh_tw: 歡迎登入

# Passkey.addNew
source: 添加新的 Passkey
en: Add New Passkey
ja: 新しい Passkey を追加
zh_tw: 新增 Passkey

# Passkey.backedUp
source: 已备份
en: Backed up
ja: バックアップ済み
zh_tw: 已備份

# Passkey.confirmDelete
source: 确认删除
en: Confirm Delete
ja: 削除を確認
zh_tw: 確認刪除

# Passkey.createdAt
source: 创建于: {date}
en: Created: {date}
ja: 作成日: {date}
zh_tw: 建立於: {date}

# Passkey.createdOn
source: 创建于
en: Created on
ja: 作成日
zh_tw: 建立於

# Passkey.crossPlatformDevice
source: 跨平台设备
en: Cross-platform device
ja: クロスプラットフォームデバイス
zh_tw: 跨平台裝置

# Passkey.delete
source: 删除 Passkey
en: Delete Passkey
ja: Passkey を削除
zh_tw: 刪除 Passkey

# Passkey.deleteConfirm
source: 确定要删除这个 Passkey 吗？此操作无法撤销。
en: Are you sure you want to delete this Passkey? This action cannot be undone.
ja: この Passkey を削除してもよろしいですか？この操作は元に戻せません。
zh_tw: 確定要刪除這個 Passkey 嗎？此操作無法撤銷。

# Passkey.deleteConfirmation
source: 确定要删除这个 Passkey 吗？此操作无法撤销。
en: Are you sure you want to delete this Passkey? This action cannot be undone.
ja: この Passkey を削除してもよろしいですか？この操作は取り消せません。
zh_tw: 確定要刪除這個 Passkey 嗎？此操作無法撤銷。

# Passkey.deleteFailed
source: 删除 Passkey 失败
en: Failed to delete Passkey
ja: Passkey の削除に失敗しました
zh_tw: 刪除 Passkey 失敗

# Passkey.deletePasskey
source: 删除 Passkey
en: Delete Passkey
ja: Passkey を削除
zh_tw: 刪除 Passkey

# Passkey.deleteSuccess
source: Passkey 删除成功
en: Passkey deleted successfully
ja: Passkey を削除しました
zh_tw: Passkey 刪除成功

# Passkey.description
source: Passkey 提供了一种安全、便捷的无密码登录方式，使用您设备上的生物识别或 PIN 验证。
en: Passkey provides a secure, convenient passwordless login method using biometric authentication or device PIN on your device.
ja: Passkey は、デバイス上の生体認証や PIN を使用した安全で便利なパスワード不要のログイン方法を提供します。
zh_tw: Passkey 提供了一種安全、便捷的無密碼登入方式，使用您裝置上的生物識別或 PIN 驗證。

# Passkey.enterEmailFirst
source: 请先输入邮箱地址
en: Please enter your email address first
ja: まずメールアドレスを入力してください
zh_tw: 請先輸入電子郵件地址

# Passkey.keepAtLeastOne
source: 确保至少保留一个 Passkey 或其他登录方式，以防止无法访问您的账户。
en: Ensure you keep at least one Passkey or other login method to prevent losing access to your account.
ja: アカウントにアクセスできなくなることを防ぐため、少なくとも1つの Passkey または他のログイン方法を保持してください。
zh_tw: 確保至少保留一個 Passkey 或其他登入方式，以防止無法存取您的帳戶。

# Passkey.loadError
source: 无法加载 Passkey 列表
en: Unable to load Passkey list
ja: Passkey リストを読み込めませんでした
zh_tw: 無法載入 Passkey 列表

# Passkey.loading
source: 加载中...
en: Loading...
ja: 読み込み中...
zh_tw: 載入中...

# Passkey.loadingError
source: 加载 Passkey 时出现错误
en: Error loading Passkeys
ja: Passkey の読み込み中にエラーが発生しました
zh_tw: 載入 Passkey 時出現錯誤

# Passkey.loginCancelled
source: Passkey 验证已取消，请重试
en: Passkey verification cancelled, please try again
ja: Passkey 認証がキャンセルされました。もう一度お試しください
zh_tw: Passkey 驗證已取消，請重試

# Passkey.loginError
source: Passkey 登录过程中出现错误，请重试
en: An error occurred during Passkey login, please try again
ja: Passkey ログイン中にエラーが発生しました。もう一度お試しください
zh_tw: Passkey 登入過程中出現錯誤，請重試

# Passkey.loginFailed
source: Passkey 登录失败: {{error}}
en: Passkey login failed: {{error}}
ja: Passkey ログインに失敗しました: {{error}}
zh_tw: Passkey 登入失敗: {{error}}

# Passkey.loginInUse
source: 该 Passkey 已在其他地方使用，请重试
en: This Passkey is already in use elsewhere, please try again
ja: この Passkey は他の場所で使用中です。もう一度お試しください
zh_tw: 該 Passkey 已在其他地方使用，請重試

# Passkey.loginNotFound
source: 未找到对应的 Passkey，请确认您已为此邮箱注册过 Passkey
en: No matching Passkey found, please confirm you have registered a Passkey for this email
ja: 一致する Passkey が見つかりません。このメールアドレスで Passkey を登録済みであることを確認してください
zh_tw: 未找到對應的 Passkey，請確認您已為此電子郵件註冊過 Passkey

# Passkey.loginNotSupported
source: 您的设备或浏览器不支持 Passkey
en: Your device or browser does not support Passkey
ja: お使いのデバイスまたはブラウザは Passkey をサポートしていません
zh_tw: 您的裝置或瀏覽器不支援 Passkey

# Passkey.loginRejected
source: Passkey 验证被拒绝或取消
en: Passkey verification rejected or cancelled
ja: Passkey 認証が拒否またはキャンセルされました
zh_tw: Passkey 驗證被拒絕或取消

# Passkey.loginRequiredForRegister
source: 请先登录后再注册 Passkey
en: Please log in before registering a Passkey
ja: Passkey を登録する前にログインしてください
zh_tw: 請先登入後再註冊 Passkey

# Passkey.loginSuccess
source: 使用 Passkey 登录成功！
en: Successfully signed in with Passkey!
ja: Passkey でのログインに成功しました！
zh_tw: 使用 Passkey 登入成功！

# Passkey.loginTimeout
source: Passkey 验证超时，请重试
en: Passkey verification timed out, please try again
ja: Passkey 認証がタイムアウトしました。もう一度お試しください
zh_tw: Passkey 驗證超時，請重試

# Passkey.nameHint
source: 为您的 Passkey 起一个容易识别的名称，比如"我的手机"或"办公电脑"
en: Give your Passkey an easily recognizable name, like "My Phone" or "Office Computer"
ja: 「私の携帯」や「オフィスのコンピューター」など、認識しやすい名前を付けてください
zh_tw: 為您的 Passkey 起一個容易識別的名稱，比如"我的手機"或"辦公電腦"

# Passkey.nameLabel
source: Passkey 名称 (可选)
en: Passkey Name (Optional)
ja: Passkey 名 (オプション)
zh_tw: Passkey 名稱 (可選)

# Passkey.namePlaceholder
source: 输入 Passkey 标识名称，默认: {email}
en: Enter Passkey name, default: {email}
ja: Passkey 名を入力、デフォルト: {email}
zh_tw: 輸入 Passkey 標識名稱，預設: {email}

# Passkey.noPasskeys
source: 暂无 Passkey
en: No Passkeys
ja: Passkey がありません
zh_tw: 暫無 Passkey

# Passkey.noPasskeysDescription
source: 您还没有注册任何 Passkey。点击上方按钮来注册您的第一个 Passkey。
en: You haven't registered any Passkeys yet. Click the button above to register your first Passkey.
ja: まだ Passkey を登録していません。上のボタンをクリックして最初の Passkey を登録してください。
zh_tw: 您還沒有註冊任何 Passkey。點擊上方按鈕來註冊您的第一個 Passkey。

# Passkey.notLoggedIn
source: 未登录
en: not logged in
ja: ログインしていません
zh_tw: 未登入

# Passkey.platformDevice
source: 平台设备
en: Platform device
ja: プラットフォームデバイス
zh_tw: 平台裝置

# Passkey.register
source: 注册 Passkey
en: Register Passkey
ja: Passkey を登録
zh_tw: 註冊 Passkey

# Passkey.registerError
source: Passkey 注册过程中出现错误
en: An error occurred during Passkey registration
ja: Passkey 登録中にエラーが発生しました
zh_tw: Passkey 註冊過程中出現錯誤

# Passkey.registerFailed
source: Passkey 注册失败: {{error}}
en: Passkey registration failed: {{error}}
ja: Passkey の登録に失敗しました: {{error}}
zh_tw: Passkey 註冊失敗: {{error}}

# Passkey.registerSuccess
source: Passkey 注册成功！
en: Passkey registered successfully!
ja: Passkey の登録が完了しました！
zh_tw: Passkey 註冊成功！

# Passkey.registeredList
source: 已注册的 Passkey ({count})
en: Registered Passkeys ({count})
ja: 登録済み Passkey ({count})
zh_tw: 已註冊的 Passkey ({count})

# Passkey.syncingStatus
source: 正在同步状态...
en: Syncing status...
ja: ステータス同期中...
zh_tw: 正在同步狀態...

# Passkey.tipDescription
source: 确保至少保留一个 Passkey 或其他登录方式，以防止无法访问您的账户。
en: Ensure you keep at least one Passkey or other login method to prevent losing access to your account.
ja: アカウントにアクセスできなくなることを防ぐため、少なくとも1つの Passkey または他のログイン方法を保持してください。
zh_tw: 確保至少保留一個 Passkey 或其他登入方式，以防止無法存取您的帳戶。

# Passkey.tipTitle
source: 提示
en: Tip
ja: ヒント

# Passkey.title
source: Passkey 管理
en: Passkey Management

# Passkey.unnamed
source: 未命名的 Passkey
en: Unnamed Passkey
ja: 名前のない Passkey

# Passkey.unnamedPasskey
source: 未命名的 Passkey
en: Unnamed Passkey
ja: 名前のない Passkey

# Password.inputOldPassword
source: 请输入旧密码。
en: Please enter the old password.
ja: 旧パスワードを入力してください。
zh_tw: 請輸入舊密碼。

# Password.inputThreePassword
source: 请输入确认密码。
en: Please enter the confirmation password.
ja: 確認パスワードを入力してください。
zh_tw: 請輸入確認密碼。

# Password.inputTwoPassword
source: 请输入新密码。
en: Please enter the new password.
ja: 新パスワードを入力してください。
zh_tw: 請輸入新密碼。

# Password.onePassword
source: 旧密码
en: Old Password
ja: 旧パスワード
zh_tw: 舊密碼

# Password.threePassword
source: 确认密码
en: Confirm Password
ja: 確認パスワード
zh_tw: 確認密碼

# Password.twoPassword
source: 新密码
en: New Password
ja: 新パスワード
zh_tw: 新密碼
